stress-test-20250816-102954/sensor-stress-100.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking minjcho.site (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        nginx/1.18.0
Server Hostname:        minjcho.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES256-GCM-SHA384,2048,256
Server Temp Key:        X25519 253 bits
TLS Server Name:        minjcho.site

Document Path:          /api/sensor-data/1420524217000
Document Length:        3441 bytes

Concurrency Level:      100
Time taken for tests:   7.579 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      18330000 bytes
HTML transferred:       17205000 bytes
Requests per second:    659.68 [#/sec] (mean)
Time per request:       151.588 [ms] (mean)
Time per request:       1.516 [ms] (mean, across all concurrent requests)
Transfer rate:          2361.71 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        5   94  23.2     95     180
Processing:     8   56  23.6     53     150
Waiting:        2   40  20.5     35     139
Total:         13  150  30.6    144     285

Percentage of the requests served within a certain time (ms)
  50%    144
  66%    156
  75%    164
  80%    172
  90%    193
  95%    214
  98%    226
  99%    235
 100%    285 (longest request)