stress-test-20250816-102954/sensor-stress-1000.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking minjcho.site (be patient)
Completed 500 requests
SSL handshake failed (1).
006EADB8E4790000:error:0A000126:SSL routines:ssl3_read_n:unexpected eof while reading:../ssl/record/rec_layer_s3.c:317:
SSL handshake failed (1).
006EADB8E4790000:error:0A000126:SSL routines:ssl3_read_n:unexpected eof while reading:../ssl/record/rec_layer_s3.c:317:
SSL handshake failed (1).
006EADB8E4790000:error:0A000126:SSL routines:ssl3_read_n:unexpected eof while reading:../ssl/record/rec_layer_s3.c:317:
SSL handshake failed (1).
006EADB8E4790000:error:0A000126:SSL routines:ssl3_read_n:unexpected eof while reading:../ssl/record/rec_layer_s3.c:317:
SSL handshake failed (1).
006EADB8E4790000:error:0A000126:SSL routines:ssl3_read_n:unexpected eof while reading:../ssl/record/rec_layer_s3.c:317:
SSL handshake failed (1).
006EADB8E4790000:error:0A000126:SSL routines:ssl3_read_n:unexpected eof while reading:../ssl/record/rec_layer_s3.c:317:
SSL handshake failed (1).
006EADB8E4790000:error:0A000126:SSL routines:ssl3_read_n:unexpected eof while reading:../ssl/record/rec_layer_s3.c:317:
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        nginx/1.18.0
Server Hostname:        minjcho.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES256-GCM-SHA384,2048,256
Server Temp Key:        X25519 253 bits
TLS Server Name:        minjcho.site

Document Path:          /api/sensor-data/1420524217000
Document Length:        3441 bytes

Concurrency Level:      1000
Time taken for tests:   8.035 seconds
Complete requests:      5000
Failed requests:        522
   (Connect: 0, Receive: 0, Length: 300, Exceptions: 222)
Total transferred:      17255862 bytes
HTML transferred:       16196787 bytes
Requests per second:    622.28 [#/sec] (mean)
Time per request:       1606.981 [ms] (mean)
Time per request:       1.607 [ms] (mean, across all concurrent requests)
Transfer rate:          2097.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  962 291.7   1014    1822
Processing:    32  537 415.4    363    2879
Waiting:        0  403 394.9    284    2821
Total:         68 1499 401.0   1385    3698

Percentage of the requests served within a certain time (ms)
  50%   1385
  66%   1477
  75%   1562
  80%   1574
  90%   2193
  95%   2429
  98%   2604
  99%   2678
 100%   3698 (longest request)