stress-test-20250816-102954/sensor-stress-500.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking minjcho.site (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        nginx/1.18.0
Server Hostname:        minjcho.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES256-GCM-SHA384,2048,256
Server Temp Key:        X25519 253 bits
TLS Server Name:        minjcho.site

Document Path:          /api/sensor-data/1420524217000
Document Length:        3441 bytes

Concurrency Level:      500
Time taken for tests:   7.846 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      18330000 bytes
HTML transferred:       17205000 bytes
Requests per second:    637.27 [#/sec] (mean)
Time per request:       784.602 [ms] (mean)
Time per request:       1.569 [ms] (mean, across all concurrent requests)
Transfer rate:          2281.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4  475 125.5    485     771
Processing:    32  269 107.1    267     677
Waiting:        3  176  79.1    170     640
Total:         37  744 142.5    724    1429

Percentage of the requests served within a certain time (ms)
  50%    724
  66%    772
  75%    809
  80%    828
  90%    896
  95%   1087
  98%   1165
  99%   1169
 100%   1429 (longest request)