stress-test-20250816-102954/ultimate-http.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking minjcho.site (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
SSL handshake failed (1).
009EEDB5FF750000:error:0A000126:SSL routines:ssl3_read_n:unexpected eof while reading:../ssl/record/rec_layer_s3.c:317:
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        nginx/1.18.0
Server Hostname:        minjcho.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES256-GCM-SHA384,2048,256
Server Temp Key:        X25519 253 bits
TLS Server Name:        minjcho.site

Document Path:          /api/sensor-data/1420524217000
Document Length:        3441 bytes

Concurrency Level:      1000
Time taken for tests:   22.066 seconds
Complete requests:      10000
Failed requests:        517
   (Connect: 0, Receive: 0, Length: 259, Exceptions: 258)
Total transferred:      35714172 bytes
HTML transferred:       33522222 bytes
Requests per second:    453.19 [#/sec] (mean)
Time per request:       2206.590 [ms] (mean)
Time per request:       2.207 [ms] (mean, across all concurrent requests)
Transfer rate:          1580.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0 1482 1498.2   1019    6742
Processing:    97  642 394.3    555    4710
Waiting:        0  487 389.1    354    4288
Total:        160 2124 1595.1   1555    8085

Percentage of the requests served within a certain time (ms)
  50%   1555
  66%   1847
  75%   2019
  80%   2150
  90%   6038
  95%   6369
  98%   7430
  99%   7515
 100%   8085 (longest request)